const settings = require('../settings');
const fs = require('fs');
const path = require('path');

async function helpCommand(sock, chatId, message) {
    const helpMessage = `
*Hello! I'm 𝙿𝚁𝙼𝙾✗ 🍁*
${settings.description}

┄┄┄┄┄┄┄┄┄┄┄┄┄┄
╭╌❲ *ʙᴏᴛ ɪɴꜰᴏ* ❳
╎🚀 𝙱𝚘𝚝 : ${settings.botName || `ᴘʀᴍᴏ✗`}
╎🗳️ 𝚅𝚎𝚛𝚜𝚒𝚘𝚗 : ${settings.version || '1.0.5'}
╎👤 𝙾𝚠𝚗𝚎𝚛𝚜 : Asuka and Gaïus ッ
╎ 𝙷𝚘𝚜𝚝 𝚋𝚢 ᴘʀᴍᴏ✗ ᴡᴇʙ
╰╌╌╌╌⃘࿐

*Ξ 𝙰𝚕𝚕 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 𝙻𝚒𝚜𝚝 :*

┏━━ 🐋 𝙼𝚊𝚒𝚗 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 ━┓
┃❖ .𝚊𝚕𝚒𝚟𝚎
┃❖ .𝚖𝚎𝚗𝚞
┃❖ .𝚙𝚒𝚗𝚐
┗━࿐

┏━━ 🧭 𝙱𝚊𝚜𝚒𝚌 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 ━┓
┃❖ .𝚗𝚎𝚠𝚜 [𝚌𝚘𝚞𝚗𝚝𝚛𝚢]
┃❖ .𝚠𝚎𝚊𝚝𝚑𝚎𝚛 [𝚌𝚒𝚝𝚢]
┃❖ .𝚊𝚝𝚝𝚙 [𝚝𝚎𝚡𝚝]
┃❖ .𝚝𝚝𝚜 [𝚝𝚎𝚡𝚝] (𝚝𝚎𝚡𝚝 𝚝𝚘 𝚊𝚞𝚍𝚒𝚘)
┃❖ .𝚞𝚛𝚕 (𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚒𝚖𝚐/𝚍𝚘𝚌/𝚟𝚒𝚍𝚎𝚘)
┃❖ .𝚐𝚛𝚘𝚞𝚙𝚒𝚗𝚏𝚘 (𝚐𝚛𝚘𝚞𝚙 𝚘𝚗𝚕𝚢)
┃❖ .𝚓𝚒𝚍 (𝚐𝚛𝚘𝚞𝚙 𝚘𝚗𝚕𝚢)
┃❖ .𝚚𝚞𝚘𝚝𝚎 (𝚌𝚊𝚙𝚝𝚒𝚘𝚗𝚜)
┃❖ .𝚊𝚍𝚖𝚒𝚗 𝚘𝚛 𝚜𝚝𝚊𝚏𝚏 (𝚐𝚛𝚘𝚞𝚙 𝚘𝚗𝚕𝚢)
┃❖ .𝚝𝚊𝚐 [𝚖𝚎𝚜𝚜𝚊𝚐𝚎]
┃❖ .𝚜𝚜 [𝚠𝚎𝚋 𝚞𝚛𝚕]
┃❖ .8𝚋𝚊𝚕𝚕 [𝚝𝚎𝚡𝚝 𝚘𝚛 𝚚𝚞𝚎𝚜𝚝𝚒𝚘𝚗]
┃❖ .𝚏𝚊𝚌𝚝 [𝚝𝚎𝚡𝚝 𝚘𝚛 𝚚𝚞𝚎𝚜𝚝𝚒𝚘𝚗]
┃❖ .𝚝𝚛𝚝 [𝚝𝚎𝚡𝚝/𝚕𝚊𝚗𝚐]
┃❖ .𝚟𝚟 (𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚒𝚖𝚊𝚐𝚎)
┃❖ .𝚓𝚘𝚔𝚎 [𝚝𝚎𝚡𝚝 - 𝚘𝚙𝚝𝚒𝚘𝚗]
┃❖ .𝚕𝚢𝚛𝚒𝚌𝚜 [𝚜𝚘𝚗𝚐 𝚝𝚒𝚝𝚕𝚎]
┗━࿐

┏━━ 🧸 𝙰𝙸 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 ━┓
┃❖ .𝚐𝚙𝚝 [𝚚𝚞𝚎𝚜𝚝𝚒𝚘𝚗]
┃❖ .𝚍𝚎𝚎𝚙𝚜𝚎𝚎𝚔 [𝚚𝚞𝚎𝚜𝚝𝚒𝚘𝚗]
┃❖ .𝚐𝚎𝚖𝚒𝚗𝚒 [𝚚𝚞𝚎𝚜𝚝𝚒𝚘𝚗]
┃❖ .𝚒𝚖𝚊𝚐𝚒𝚗𝚎 [𝚙𝚛𝚘𝚖𝚙𝚝 𝚝𝚎𝚡𝚝]
┃❖ 𝚏𝚕𝚞𝚡 [𝚙𝚛𝚘𝚖𝚙𝚝 𝚝𝚎𝚡𝚝]
┃❖ .𝚜𝚘𝚛𝚊 [𝚙𝚛𝚘𝚖𝚙𝚝 𝚝𝚎𝚡𝚝]
┃❖ .𝚌𝚑𝚊𝚝𝚋𝚘𝚝 (𝚏𝚘𝚛 𝚐𝚛𝚘𝚞𝚙𝚜 𝚘𝚗𝚕𝚢)
┗━࿐

┏━━ 📥 𝙳𝚘𝚠𝚗𝚕𝚘𝚊𝚍𝚎𝚛 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 ━┓
┃❖ .𝚙𝚕𝚊𝚢 [𝚜𝚘𝚗𝚐 𝚗𝚊𝚖𝚎]
┃❖ .𝚜𝚘𝚗𝚐 [𝚜𝚘𝚗𝚐 𝚗𝚊𝚖𝚎]
┃❖ .𝚜𝚙𝚘𝚝𝚒𝚏𝚢 [𝚚𝚞𝚎𝚛𝚢]
┃❖ .𝚒𝚗 𝚘𝚛 𝚒𝚗𝚜𝚝𝚊𝚐𝚛𝚊𝚖 [𝚕𝚒𝚗𝚔]
┃❖ .𝚏𝚋 𝚘𝚛 𝚏𝚊𝚌𝚎𝚋𝚘𝚘𝚔 [𝚕𝚒𝚗𝚔]
┃❖ .𝚝𝚝 𝚘𝚛 𝚝𝚒𝚔𝚝𝚘𝚔 [𝚕𝚒𝚗𝚔]
┃❖ .𝚟𝚒𝚍𝚎𝚘 [𝚟𝚒𝚍𝚎𝚘 𝚗𝚊𝚖𝚎]
┃❖ .𝚖𝚙3 [𝚕𝚒𝚗𝚔]
┃❖ .𝚢𝚝𝚖𝚙4 [𝚕𝚒𝚗𝚔]
┗━࿐

┏━━ 🎴 𝙸𝚖𝚊𝚐𝚎 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 ━┓
┃❖ .𝚋𝚕𝚞𝚛 [𝚒𝚖𝚊𝚐𝚎 𝚌𝚊𝚙𝚝𝚒𝚘𝚗]
┃❖ .𝚛𝚎𝚖𝚘𝚟𝚎𝚋𝚐 [𝚒𝚖𝚊𝚐𝚎 𝚌𝚊𝚙𝚝𝚒𝚘𝚗]
┃❖ .𝚛𝚎𝚖𝚒𝚗𝚒
┃❖ .𝚌𝚛𝚘𝚙 (𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚒𝚖𝚊𝚐𝚎)
┃❖ .𝚖𝚎𝚖𝚎
┃❖ .𝚒𝚐𝚜 [𝚒𝚗𝚜𝚝𝚊 𝚕𝚒𝚗𝚔]
┃❖ .𝚒𝚐𝚜𝚌 [𝚒𝚗𝚜𝚝𝚊 𝚕𝚒𝚗𝚔]
┗━࿐

┏━━ 🐥 𝚂𝚝𝚒𝚌𝚔𝚎𝚛 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 ━┓
┃❖ .𝚊𝚗𝚒𝚖𝚞 [𝚚𝚞𝚎𝚛𝚢]
┃❖ .𝚜𝚝𝚒𝚌𝚔𝚎𝚛 (𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚒𝚖𝚊𝚐𝚎)
┃❖ .𝚎𝚖𝚘𝚓𝚒𝚖𝚒𝚡 [𝚎𝚖𝚘𝚓𝚒1]+[𝚎𝚖𝚘𝚓𝚒2]
┃❖ .𝚝𝚊𝚔𝚎 [𝚙𝚊𝚌𝚔𝚗𝚊𝚖𝚎]
┃❖ .𝚝𝚐𝚜𝚝𝚒𝚌𝚔𝚎𝚛 [𝚕𝚒𝚗𝚔]
┃❖ .𝚜𝚒𝚖𝚊𝚐𝚎 (𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚒𝚖𝚊𝚐𝚎)
┗━࿐

┏━━ 🪪 𝙰𝚍𝚖𝚒𝚗 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 ━┓
┃❖ .𝚋𝚊𝚗 [@𝚞𝚜𝚎𝚛]ban @user
┃❖ .𝚞𝚗𝚖𝚞𝚝𝚎
┃❖ .𝚖𝚞𝚝𝚎 [𝚖𝚒𝚗𝚞𝚝𝚎𝚜]
┃❖ .𝚍𝚎𝚖𝚘𝚝𝚎 [@𝚞𝚜𝚎𝚛]
┃❖ .𝚙𝚛𝚘𝚖𝚘𝚝𝚎 [@𝚞𝚜𝚎𝚛]
┃❖ .𝚍𝚎𝚕𝚎𝚝𝚎 (𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚒𝚖𝚊𝚐𝚎)
┃❖ .𝚠𝚊𝚛𝚗 [@𝚞𝚜𝚎𝚛]
┃❖ .𝚠𝚊𝚛𝚗𝚒𝚗𝚐𝚜 [@𝚞𝚜𝚎𝚛]
┃❖ .𝚔𝚒𝚌𝚔 [@𝚞𝚜𝚎𝚛]
┃❖ .𝚊𝚗𝚝𝚒𝚕𝚒𝚗𝚔
┃❖ .𝚊𝚗𝚝𝚒𝚋𝚊𝚍𝚠𝚘𝚛𝚍
┃❖ .𝚌𝚕𝚎𝚊𝚛
┃❖ .𝚝𝚊𝚐𝚊𝚕𝚕 [𝚖𝚎𝚜𝚜𝚊𝚐𝚎]
┃❖ .𝚝𝚊𝚐𝚗𝚘𝚝𝚊𝚍𝚖𝚒𝚗
┃❖ .𝚑𝚒𝚍𝚎𝚝𝚊𝚐 [𝚖𝚎𝚜𝚜𝚊𝚐𝚎]
┃❖ .𝚛𝚎𝚜𝚎𝚝𝚕𝚒𝚗𝚔
┃❖ .𝚊𝚗𝚝𝚒𝚝𝚊𝚐 [𝚘𝚗/𝚘𝚏𝚏]
┃❖ .𝚠𝚎𝚕𝚌𝚘𝚖𝚎 [𝚘𝚗/𝚘𝚏𝚏]
┃❖ .𝚐𝚘𝚘𝚍𝚋𝚢𝚎 [𝚘𝚗/𝚘𝚏𝚏]
┃❖ .𝚜𝚎𝚝𝚐𝚍𝚎𝚜𝚌 [𝚍𝚎𝚜𝚌𝚛𝚒𝚙𝚝𝚒𝚘𝚗]
┃❖ .𝚜𝚎𝚝𝚐𝚗𝚊𝚖𝚎 [𝚗𝚊𝚖𝚎]
┃❖ .𝚜𝚎𝚝𝚐𝚙𝚙 (𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚒𝚖𝚊𝚐𝚎
┗━࿐

┏━━ 🔐 𝙾𝚠𝚗𝚎𝚛 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 ━┓
┃❖ .𝚖𝚘𝚍𝚎 [𝚙𝚞𝚋𝚕𝚒𝚌/𝚙𝚛𝚒𝚟𝚊𝚝𝚎]
┃❖ .𝚞𝚙𝚍𝚊𝚝𝚎
┃❖ .𝚌𝚕𝚎𝚊𝚛𝚜𝚎𝚜𝚜𝚒𝚘𝚗
┃❖ .𝚊𝚗𝚝𝚒𝚍𝚎𝚕𝚎𝚝𝚎 𝚘𝚛 𝚍𝚎𝚕
┃❖ .𝚌𝚕𝚎𝚊𝚛𝚝𝚖𝚙
┃❖ .𝚜𝚎𝚝𝚝𝚒𝚗𝚐𝚜
┃❖ .𝚜𝚎𝚝𝚙𝚙 (𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚒𝚖𝚊𝚐𝚎)
┃❖ .𝚊𝚞𝚝𝚘𝚛𝚎𝚊𝚌𝚝 [𝚘𝚗/𝚘𝚏𝚏]
┃❖ .𝚊𝚞𝚝𝚘𝚛𝚎𝚊𝚍 [𝚘𝚗/𝚘𝚏𝚏]
┃❖ .𝚊𝚞𝚝𝚘𝚜𝚝𝚊𝚝𝚞𝚜 [𝚘𝚗/𝚘𝚏𝚏]
┃❖ .𝚊𝚞𝚝𝚘𝚜𝚝𝚊𝚝𝚞𝚜 𝚛𝚎𝚊𝚌𝚝 [𝚘𝚗/𝚘𝚏𝚏]
┃❖ .𝚊𝚞𝚝𝚘𝚝𝚢𝚙𝚒𝚗𝚐 [𝚘𝚗/𝚘𝚏𝚏]
┃❖ .𝚊𝚗𝚝𝚒𝚌𝚊𝚕𝚕 [𝚘𝚗/𝚘𝚏𝚏]
┃❖ .𝚙𝚖𝚋𝚕𝚘𝚌𝚔𝚎𝚛 [𝚜𝚝𝚊𝚝𝚞𝚜]
┃❖ .𝚜𝚎𝚝𝚖𝚎𝚗𝚝𝚒𝚘𝚗 (𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚖𝚎𝚜𝚜𝚊𝚐𝚎)
┃❖ .𝚙𝚖𝚋𝚕𝚘𝚌𝚔𝚎𝚛 𝚜𝚎𝚝𝚖𝚜𝚐 [𝚝𝚎𝚡𝚝]
┃❖ .𝚜𝚎𝚝𝚖𝚎𝚗𝚝𝚒𝚘𝚗 (𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚖𝚎𝚜𝚜𝚊𝚐𝚎)
┃❖ .𝚖𝚎𝚗𝚝𝚒𝚘𝚗 [𝚘𝚗/𝚘𝚏𝚏]
┗━࿐

┏━━ ❄️ 𝙿𝚒𝚎𝚜 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 ━┓
┃❖ .𝚙𝚒𝚎𝚜 [𝚌𝚘𝚞𝚗𝚝𝚛𝚢]
┃❖ .𝚓𝚊𝚙𝚊𝚗
┃❖ .𝚑𝚒𝚓𝚊𝚋
┃❖ .𝚒𝚗𝚍𝚘𝚗𝚎𝚜𝚒𝚊
┃❖ .𝚌𝚑𝚒𝚗𝚊
┃❖ .𝚔𝚘𝚛𝚎𝚊
┗━࿐

┏━━ 🎭 𝙵𝚞𝚗 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 ━┓
┃❖ .𝚜𝚝𝚞𝚙𝚒𝚍 [@𝚞𝚜𝚎𝚛][𝚝𝚎𝚡𝚝]
┃❖ .𝚏𝚕𝚒𝚛𝚝
┃❖ .𝚒𝚗𝚜𝚞𝚕𝚝 [@𝚞𝚜𝚎𝚛]
┃❖ .𝚜𝚑𝚊𝚢𝚊𝚛𝚒
┃❖ .𝚐𝚘𝚘𝚍𝚗𝚒𝚐𝚑𝚝
┃❖ .𝚛𝚘𝚜𝚎𝚍𝚊𝚢
┃❖ .𝚌𝚑𝚊𝚛𝚊𝚌𝚝𝚎𝚛 [@𝚞𝚜𝚎𝚛]
┃❖ .wasted @user
┃❖ .ship @user
┃❖ .simp @user
┃❖ .𝚌𝚘𝚖𝚙𝚕𝚒𝚖𝚎𝚗𝚝 [@𝚞𝚜𝚎𝚛]
┗━࿐

┏━━ 🆕 𝚃𝚎𝚡𝚝𝚖𝚊𝚔𝚎𝚛 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 ━┓
┃❖ .𝚝𝚑𝚞𝚗𝚍𝚎𝚛 [𝚝𝚎𝚡𝚝]
┃❖ .𝚒𝚌𝚎 [𝚝𝚎𝚡𝚝]
┃❖ .𝚜𝚗𝚘𝚠 [𝚝𝚎𝚡𝚝]
┃❖ .𝚗𝚎𝚘𝚗 [𝚝𝚎𝚡𝚝]
┃❖ .𝚒𝚖𝚙𝚛𝚎𝚜𝚎𝚒𝚟𝚎 [𝚝𝚎𝚡𝚝]
┃❖ .𝚕𝚒𝚐𝚑𝚝 [𝚝𝚎𝚡𝚝]
┃❖ .𝚖𝚊𝚝𝚛𝚒𝚡 [𝚝𝚎𝚡𝚝]
┃❖ .𝚍𝚎𝚟𝚒𝚕 [𝚝𝚎𝚡𝚝]
┃❖ .𝚍𝚎𝚟𝚒𝚕 [𝚝𝚎𝚡𝚝]
┃❖ .𝚖𝚎𝚝𝚊𝚕𝚕𝚒𝚌 [𝚝𝚎𝚡𝚝]
┃❖ .𝚕𝚎𝚊𝚟𝚎𝚜 [𝚝𝚎𝚡𝚝]
┃❖ .1917 [𝚝𝚎𝚡𝚝]
┃❖ .𝚜𝚊𝚗𝚍 [𝚝𝚎𝚡𝚝]
┃❖ .𝚑𝚊𝚌𝚔𝚎𝚛 [𝚝𝚎𝚡𝚝]
┃❖ .𝚊𝚛𝚎𝚗𝚊 [𝚝𝚎𝚡𝚝]
┃❖ .𝚋𝚕𝚊𝚌𝚔𝚙𝚒𝚗𝚔 [𝚝𝚎𝚡𝚝]
┃❖ .𝚐𝚕𝚒𝚝𝚌𝚑 [𝚝𝚎𝚡𝚝]
┃❖ .𝚏𝚒𝚛𝚎 [𝚝𝚎𝚡𝚝]
┗━࿐

┏━━ 🪢 𝙼𝙸𝚂𝙲 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 ━┓
┃❖ .𝚑𝚘𝚛𝚗𝚢
┃❖ .𝚕𝚘𝚕𝚒𝚌𝚎
┃❖ .𝚕𝚐𝚋𝚝
┃❖ .𝚌𝚒𝚛𝚌𝚕𝚎
┃❖ .𝚑𝚎𝚊𝚛𝚝
┃❖ .𝚒𝚝𝚜-𝚜𝚘-𝚜𝚝𝚞𝚙𝚒𝚍
┃❖ .𝚗𝚊𝚖𝚎𝚌𝚊𝚛𝚍
┃❖ .𝚘𝚘𝚐𝚠𝚊𝚢
┃❖ .𝚝𝚠𝚎𝚎𝚝
┃❖ .𝚢𝚝𝚌𝚘𝚖𝚖𝚎𝚗𝚝
┃❖ .𝚌𝚘𝚖𝚛𝚊𝚍𝚎
┃❖ .𝚐𝚊𝚢
┃❖ .𝚐𝚕𝚊𝚜𝚜
┃❖ .𝚓𝚊𝚒𝚕
┃❖ .𝚙𝚊𝚜𝚜𝚎𝚍
┃❖ .𝚝𝚛𝚒𝚐𝚐𝚎𝚛𝚎𝚍
┗━࿐

┏━━ 🎠 𝙰𝚗𝚒𝚖𝚎 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 ━┓
┃❖ .𝚕𝚘𝚙𝚒
┃❖ .𝚗𝚘𝚖
┃❖ .𝚑𝚞𝚐
┃❖ .𝚏𝚊𝚌𝚎𝚙𝚊𝚕𝚖
┃❖ .𝚔𝚒𝚜𝚜
┃❖ .𝚙𝚊𝚝
┃❖ .𝚙𝚘𝚔𝚎
┃❖ .𝚠𝚒𝚗𝚔
┃❖ .𝚌𝚛𝚢
┗━࿐

┏━━ 🛸 𝙶𝚒𝚝𝚑𝚞𝚋 𝙲𝚘𝚖𝚖𝚊𝚗𝚍𝚜 ━┓
┃❖ .𝚘𝚠𝚗𝚎𝚛
┃❖ .𝚐𝚒𝚝𝚑𝚞𝚋
┃❖ .𝚜𝚌
┃❖ .𝚐𝚒𝚝
┃❖ .𝚙𝚊𝚒𝚛
┃❖ .𝚜𝚌𝚛𝚒𝚙𝚝
┃❖ .𝚛𝚎𝚙𝚘
┗━࿐
© ʙʏ ᴘʀᴍᴏ✗ ᴡᴇʙ`;

    try {
        const imagePath = path.join(__dirname, '../assets/prmox-bot.jpg');
        
        if (fs.existsSync(imagePath)) {
            const imageBuffer = fs.readFileSync(imagePath);
                    await sock.sendMessage(chatId, {
            react: { text: '📖', key: message.key }
        });
            await sock.sendMessage(chatId, {
                image: imageBuffer,
                caption: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363423930246587@newsletter',
                        newsletterName: 'ᴘʀᴍᴏ✗ ᴡᴇʙ',
                        serverMessageId: -1
                    }
                }
            },{ quoted: message });
        } else {
            console.error('Bot image not found at:', imagePath);
            await sock.sendMessage(chatId, { 
                text: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363423930246587@newsletter',
                        newsletterName: 'ᴘʀᴍᴏ✗ ᴡᴇʙ',
                        serverMessageId: -1
                    } 
                }
            });
        }
    } catch (error) {
        console.error('Error in help command:', error);
        await sock.sendMessage(chatId, { text: helpMessage });
    }
}

module.exports = helpCommand;
